<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Цели-исследования." data-toc-modified-id="Цели-исследования.-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Цели исследования.</a></span></li><li><span><a href="#Задания." data-toc-modified-id="Задания.-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Задания.</a></span></li><li><span><a href="#Знакомство-с-данными." data-toc-modified-id="Знакомство-с-данными.-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Знакомство с данными.</a></span><ul class="toc-item"><li><span><a href="#Посчитайте,-сколько-книг-вышло-после-1-января-2000-года?" data-toc-modified-id="Посчитайте,-сколько-книг-вышло-после-1-января-2000-года?-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Посчитайте, сколько книг вышло после 1 января 2000 года?</a></span></li><li><span><a href="#Для-каждой-книги-посчитайте-количество-обзоров-и-среднюю-оценку." data-toc-modified-id="Для-каждой-книги-посчитайте-количество-обзоров-и-среднюю-оценку.-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Для каждой книги посчитайте количество обзоров и среднюю оценку.</a></span></li><li><span><a href="#Определите-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-—-так-вы-исключите-из-анализа-брошюры." data-toc-modified-id="Определите-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-—-так-вы-исключите-из-анализа-брошюры.-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры.</a></span></li><li><span><a href="#Определите-автора-с-самой-высокой-средней-оценкой-книг-—-учитывайте-только-книги-с-50-и-более-оценками." data-toc-modified-id="Определите-автора-с-самой-высокой-средней-оценкой-книг-—-учитывайте-только-книги-с-50-и-более-оценками.-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками.</a></span></li><li><span><a href="#Посчитайте-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-48-оценок." data-toc-modified-id="Посчитайте-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-48-оценок.-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>Посчитайте среднее количество обзоров от пользователей, которые поставили больше 48 оценок.</a></span></li></ul></li><li><span><a href="#Общий-итог." data-toc-modified-id="Общий-итог.-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Общий итог.</a></span></li><li><span><a href="#Рекомендации." data-toc-modified-id="Рекомендации.-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Рекомендации.</a></span></li></ul></div>

# Исследование рейтинга книг.

Коронавирус застал мир врасплох, изменив привычный порядок вещей. На какое-то время жители городов перестали выходить на улицу, посещать кафе и торговые центры. Зато стало больше времени для книг. Это заметили стартаперы — и бросились создавать приложения для тех, кто любит читать.  
  
Ваша компания решила быть на волне и купила крупный сервис для чтения книг по подписке. Ваша первая задача как аналитика — проанализировать базу данных.  
  
В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта.

## Цели исследования.

Опредиление рейтинга книг, авторов и издательств.

## Задания.

- Посчитайте, сколько книг вышло после 1 января 2000 года;
- Для каждой книги посчитайте количество обзоров и среднюю оценку;
- Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;
- Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками;
- Посчитайте среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

In [1]:
# импортируем библиотеки
import pandas as pd
import sqlalchemy as sa

In [2]:
# устанавливаем параметры
db_config = {
             'user': 'praktikum_student', # имя пользователя
             'pwd': 'Sdf4$2;d-d30pp', # пароль
             'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
             'port': 6432, # порт подключения
             'db': 'data-analyst-final-project-db' # название базы данных
            }
connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)

# сохраняем коннектор
engine = sa.create_engine(connection_string, connect_args={'sslmode':'require'})

# чтобы выполнить SQL-запрос, пишем функцию с использованием Pandas
def get_sql_data(query:str, engine:sa.engine.base.Engine=engine) -> pd.DataFrame:
    '''Открываем соединение, получаем данные из sql, закрываем соединение'''
    with engine.connect() as con:
        return pd.read_sql(sql=sa.text(query), con = con)

## Знакомство с данными.

Таблица **books** содержит данные о книгах:
- *book_id* — идентификатор книги;
- *author_id* — идентификатор автора;
- *title* — название книги;
- *num_pages* — количество страниц;
- *publication_date* — дата публикации книги;
- *publisher_id* — идентификатор издателя.

In [3]:
query = '''SELECT * FROM books LIMIT 5'''
get_sql_data(query)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [4]:
query = '''SELECT COUNT(*) FROM books'''
get_sql_data(query)

   count
0   1000

Таблица **authors** содержит данные об авторах:
- *author_id* — идентификатор автора;
- *author* — имя автора.

In [5]:
query = '''SELECT * FROM authors LIMIT 5'''
get_sql_data(query)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [6]:
query = '''SELECT COUNT(*) FROM authors'''
get_sql_data(query)

   count
0    636

Таблица **publishers** содержит данные об издательствах:
- *publisher_id* — идентификатор издательства;
- *publisher* — название издательства;

In [7]:
query = '''SELECT * FROM publishers LIMIT 5'''
get_sql_data(query)

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [8]:
query = '''SELECT COUNT(*) FROM publishers'''
get_sql_data(query)

   count
0    340

Таблица **ratings** содержит данные о пользовательских оценках книг:
- *rating_id* — идентификатор оценки;
- *book_id* — идентификатор книги;
- *username* — имя пользователя, оставившего оценку;
- *rating* — оценка книги.

In [9]:
query = '''SELECT * FROM ratings LIMIT 5'''
get_sql_data(query)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [10]:
query = '''SELECT COUNT(*) FROM ratings'''
get_sql_data(query)

   count
0   6456

Таблица **reviews** содержит данные о пользовательских обзорах на книги:
- *review_id* — идентификатор обзора;
- *book_id* — идентификатор книги;
- *username* — имя пользователя, написавшего обзор;
- *text* — текст обзора.

In [ ]:
query = '''SELECT * FROM reviews LIMIT 5'''
get_sql_data(query)

In [ ]:
query = '''SELECT COUNT(*) FROM reviews'''
get_sql_data(query)

### Посчитайте, сколько книг вышло после 1 января 2000 года?

In [ ]:
query = '''SELECT 
                COUNT(title) AS books_count
           FROM books
           WHERE publication_date >= '2000-01-01'
        '''
get_sql_data(query)

После 1 января 2000 года вышла 821 книга.

### Для каждой книги посчитайте количество обзоров и среднюю оценку.

In [ ]:
query = '''SELECT
                 books.title AS book_title,
                 books.book_id AS book_id,
                 AVG(ratings.rating) AS avg_rating,
                 COUNT(DISTINCT reviews.review_id) AS count_reviews
            FROM books
                 INNER JOIN ratings ON ratings.book_id = books.book_id
                 LEFT JOIN reviews ON reviews.book_id = books.book_id
            GROUP BY
                 books.title,
                 books.book_id
            ORDER BY
                 count_reviews DESC;
        '''
get_sql_data(query).round(3).head(10)

По количеству обзоров лидирует книга *Twilight* (*Twilight* #1)

### Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры.

In [ ]:
query_pub = '''SELECT 
                     publishers.publisher_id, 
                     publishers.publisher, 
                     COUNT(books.book_id) as count_books
                FROM publishers
                     JOIN books ON publishers.publisher_id = books.publisher_id
                     WHERE 
                         books.num_pages > 50
                     GROUP BY publishers.publisher_id
                     ORDER BY count_books DESC
                     LIMIT 10;
                 ''' 
get_sql_data(query_pub)

Издательство **Penguin Books** выпустило наибольшее число книг - 42.

### Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками.

In [ ]:
query_avg = '''SELECT
                     authors.author_id AS id,
                     authors.author AS author,
                     AVG(ratings.rating) AS avg_rating,
                     COUNT(ratings.rating) AS count_rating
                FROM authors
                     INNER JOIN books ON books.author_id = authors.author_id
                     INNER JOIN ratings ON ratings.book_id = books.book_id
                GROUP BY id, author
                     HAVING 
                     COUNT(ratings.rating) >= 50 
                ORDER BY
                     count_rating DESC
                     LIMIT 1
            '''
get_sql_data(query_avg).round(3)

Автор с самой высокой средней оценкой книг и с оценкой книг не менее 50 - **J.K. Rowling/Mary GrandPré**

### Посчитайте среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

In [ ]:
query_user = '''SELECT
                      AVG(review.review_cnt) AS avg_review
                FROM  (SELECT COUNT(review_id) AS review_cnt
                FROM  reviews
                WHERE username
                      IN (SELECT username
                FROM  ratings
                GROUP BY username
                      HAVING
                      COUNT(ratings) > 48)
                GROUP BY username) AS review
            '''
get_sql_data(query_user).round(3)

Среднее количество обзоров от пользователей, которые поставили больше 48 оценок - 24.

## Общий итог.

- После 1 января 2000 года вышла 821 книга.
- Для каждой книги составили таблицу количества обзоров и средней оценки. По количеству обзоров лидирует книга *Twilight* (*Twilight* #1)
- Издательство **Penguin Books** выпустило наибольшее число книг - 42.
- Автор с самой высокой средней оценкой книг и с оценкой книг не менее 50 - **J.K. Rowling/Mary GrandPré**.
- Среднее количество обзоров от пользователей, которые поставили больше 48 оценок - 24.

## Рекомендации.

Для привлечения клиентов следует ориентироваться на популярных авторов, бестселлеры.  
Можно добавить разные тематическии статьи и рецензии по новым и вновь переизданным книгам.  
Создать анонсирование выхода новых книг популярных авторов и своевременное их появление на сервисе.